Revit 2027 API
DirectShapeType.IsValidUsage Method
 Validates that the ExternallyTaggedGeometryObject's usage is set to an allowed value for a DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidUsage(
	ExternallyTaggedGeometryObject externallyTaggedGeometry
)
Public Function IsValidUsage (
	externallyTaggedGeometry As ExternallyTaggedGeometryObject
) As Boolean
public:
bool IsValidUsage(
	ExternallyTaggedGeometryObject^ externallyTaggedGeometry
)
member IsValidUsage :
        externallyTaggedGeometry : ExternallyTaggedGeometryObject -> bool
Parameters
externallyTaggedGeometry ExternallyTaggedGeometryObject
 The geometry to check.
Return Value
Boolean
 True if the usage is permitted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace